[
  {
    "id": 1,
    "name": "The Web Developer Bootcamp 2021",
    "image": "https://img-c.udemycdn.com/course/240x135/625204_436a_3.jpg",
    "rating": "4",
    "category": "Web Development",
    "enrolled": "715,722",
    "duration": "63 hr 07 min",
    "lectures": "42",
    "level": "Professional",
    "description": "It was so challenging and full of knowledge! I have learned a lot from this course. Colt is the best instructor, respect! He explains everything that way so you get it instantly. Unfortunately, at the end of the course a new instructor explain a bit in a different way where i did not most of the things, perhaps because of the advanced topics. Anyway, it was awesome to be a part of this course, thanks each of you, especially Ian for helping students throughout the course.",
    "instructor": "Ulvi Samadzade",
    "instructor_image": "https://img-c.udemycdn.com/user/200_H/34307734_2d47.jpg",
    "price": "13.99"
  },
  {
    "id": 2,
    "name": "Angular - The Complete Guide (2021 Edition)",
    "image": "https://img-c.udemycdn.com/course/240x135/756150_c033_2.jpg",
    "rating": "4",
    "category": "Angular",
    "enrolled": "521,646",
    "duration": "34 hr 07 min",
    "lectures": "41",
    "level": "Advance",
    "description": "Develop modern, complex, responsive and scalable web applications with Angular 12. Fully understand the architecture behind an Angular application and how to use it. Use the gained, deep understanding of the Angular fundamentals to quickly establish yourself as a frontend developer",
    "instructor": "Jason Woods",
    "instructor_image": "https://img-c.udemycdn.com/user/200_H/18928830_573e_2.jpg",
    "price": "13.99"
  },
  {
    "id": 3,
    "name": "Vue - The Complete Guide (w/ Router, Vuex, Composition API)",
    "image": "https://img-c.udemycdn.com/course/240x135/995016_ebf4_3.jpg",
    "rating": "5",
    "category": "Vue JS",
    "enrolled": "173,222",
    "duration": "48 hr 05 min",
    "lectures": "72",
    "level": "Basic",
    "description": "No matter at which metric you look at (Google Trends, Github Stars, Tweets ...) - VueJS is the shooting star in the world of JavaScript frameworks - it simply is amazing! This bestselling course teaches the latest version of Vue (Vue.js 3) from the ground up and in great detail. We'll cover all the core basics but we'll not stop thereafter - this course also dives into advanced concepts like the Composition API introduced with Vue 3.",
    "instructor": "Tony G",
    "instructor_image": "https://img-c.udemycdn.com/user/200_H/36078620_5917.jpg",
    "price": "89.99"
  },
  {
    "id": 4,
    "name": "Learn and Understand NodeJS",
    "image": "https://img-c.udemycdn.com/course/240x135/461160_8d87_6.jpg",
    "rating": "4.6",
    "category": "Node.Js",
    "enrolled": "113,444",
    "duration": "13 hr 30 min",
    "lectures": "4",
    "level": "Advance",
    "description": "NodeJS is a rapidy growing web server technology, and Node developers are among the highest paid in the industry. Knowing NodeJS well will get you a job or improve your current one by enabling you to build high quality, robust web applications. In this course you will gain a deep understanding of Node, learn how NodeJS works under the hood, and how that knowledge helps you avoid common pitfalls and drastically improve your ability to debug problems.",
    "instructor": "Pablo Magarinos",
    "instructor_image": "https://img-c.udemycdn.com/user/200_H/25871496_32fa.jpg",
    "price": "13.99"
  },
  {
    "id": 5,
    "name": "PHP for Beginners - Become a PHP Master - CMS Project",
    "image": "https://img-c.udemycdn.com/course/240x135/405282_27d2_3.jpg",
    "rating": "4.5",
    "category": "PHP",
    "enrolled": "101,072",
    "duration": "38 hr 40 min",
    "lectures": "23",
    "level": "Basic",
    "description": "Are you new to PHP or need a refresher? Then this course will help you get all the fundamentals of Procedural PHP, Object Oriented PHP, MYSQLi, and ending the course by building a CMS system similar to WordPress, Joomla, or Drupal. Knowing PHP has allowed me to make enough money to stay home and make courses like this one for students all over the world. Being a PHP developer can allow anyone to make really good money online and offline, developing dynamic applications.",
    "instructor": "Sergio Sanchez",
    "instructor_image": "https://img-c.udemycdn.com/user/200_H/24192702_dc91.jpg",
    "price": "15.50"
  },
  {
    "id": 6,
    "name": "The Complete WordPress Website Business Course",
    "image": "https://img-c.udemycdn.com/course/240x135/520116_edf5_2.jpg",
    "rating": "4.4",
    "category": "WordPress",
    "enrolled": "74,097",
    "duration": "22 hr 40 min",
    "lectures": "19",
    "level": "Basic",
    "description": "This is one of the best Word Press courses you will find. Gregg is a phenomenal instructor and his lesson plans are well designed. The lessons are very easy to comprehend and engaging. I started this course with no knowledge nor understanding of Word Press and now I'm super confident in my ability to produce quality websites!",
    "instructor": "Riccardo Aulico",
    "instructor_image": "https://img-c.udemycdn.com/user/200_H/105610218_966a.jpg",
    "price": "28.5"
  },
  {
    "id": 7,
    "name": "Modern HTML & CSS From The Beginning (Including Sass)",
    "image": "https://img-c.udemycdn.com/course/240x135/2153774_bef0_4.jpg",
    "rating": "3.5",
    "category": "CSS",
    "enrolled": "60,686",
    "duration": "21 hr 40 min",
    "lectures": "26",
    "level": "Basic",
    "description": "This course is for both beginners and seasoned developers that want to learn how to build responsive websites and user interfaces with modern HTML5 and CSS3+ technologies like Flexbox and CSS Grid as well as the Sass pre-compiler. This course includes hours of both learning & studying sections along with real life projects. Stop having to rely on frameworks like Bootstrap for your user interface and learn how to create your own layouts and utility classes to build custom responsive websites",
    "instructor": "Meet Thakkar",
    "instructor_image": "https://img-c.udemycdn.com/user/200_H/119162036_c04e.jpg",
    "price": "45"
  },
  {
    "id": 8,
    "name": "Microservices with Node JS and React",
    "image": "https://img-c.udemycdn.com/course/240x135/2887266_c696_5.jpg",
    "rating": "5",
    "category": "Microservices",
    "enrolled": "57,667",
    "duration": "54 hr 40 min",
    "lectures": "54",
    "level": "Advance",
    "description": "Microservices are the number one solution for building and scaling out apps that are intended to grow.  Just one little issue: there are few resources online that delve into the most complex and nasty issues around them!  I built this course to fix that.  This course tackles every major issues around microservices head on. From challenges with data replication to confusing unordered event streams, every major challenge of building microservices is covered. ",
    "instructor": "Kennedy Otis",
    "instructor_image": "https://img-c.udemycdn.com/user/200_H/302484_b425_2.jpg",
    "price": "65.44"
  },
  {
    "id": 9,
    "name": "ES6 Javascript: The Complete Developer's Guide",
    "image": "https://img-c.udemycdn.com/course/240x135/861624_864d_2.jpg",
    "rating": "3",
    "category": "JavaScript",
    "enrolled": "43,599",
    "duration": "35 hr 10 min",
    "lectures": "36",
    "level": "Basic",
    "description": "Mastering ES6 syntax can get you a position in web development or help you build that personal project you've been dreaming of. It's a skill that will put you more in demand in the modern web development industry, especially with the release of modern web frameworks like React and Angular 2.",
    "instructor": "Michael Menard",
    "instructor_image": "https://img-c.udemycdn.com/user/200_H/149635_be8d_2.jpg",
    "price": "35"
  }
]